#encoding:utf-8
import json

# json_str = """
#         [{
#             "author": "赏花归来蛋蛋香",
#             "content": "昨天上班时路上瞥见一辆车当时把我给惊艳到了————当时赶着上班，没多想，就是把车型记住了，就是道奇地狱猫，但是我估摸着不应该是这名字。一天无话。晚上下班时去接老婆，忽然想起来这件事，就叫老婆赶紧查一下这车有多贵。并告诉她是道奇的hellcat。她一听，立即就反应过来了，啊，这个拼写我会的，不就是hello—kitty么。幸好我驾龄长，方向盘总算没有脱手。Hello-kitty？ 丫头你是认真的么？？？"
#         }, {
#             "author": "义行天下7",
#             "content": "弟弟单身许久家人都很着急，前几天终于相了个合适的姑娘。订婚当天，我爸开车带着我弟兄俩买了好多东西浩浩荡荡的去了女方家。到了女方家后，由于弟弟在里面坐着，我先抱着两件礼物下车了，女方母亲看到后说:哎呦，当初见面的可不是这个，你们这是玩“狸猫换太子呢？这门亲事坚决不答应，你们回去吧。”"
#         }, {
#             "author": "吃了两碗又盛",
#             "content": "大姐总是吐槽她闺女越大约不跟她说话了，这次外甥女放暑假，我逮到机会跟她谈了谈，她向我保证以后跟爸妈多聊天。昨天家庭聚会，娘两个挨的很近，外甥女没话找话:妈你说这世界真黑暗啊，，，大姐截住话头:自己家的事还没整明白呢还世界，世界那么大跟你有关系吗？外甥女都大学生了，气的眼泪一下子流出来了。"
#         }]
# """
# duanzis = json.loads(json_str)
# for duanzi in duanzis:
#     print(duanzi)

with open('duanzi.json','r',encoding='utf-8') as fp:
    duanzis = json.load(fp)
    for duanzi in duanzis:
        print(duanzi)